<?php

namespace Database\Factories;

use App\Models\Book;
use Illuminate\Database\Eloquent\Factories\Factory;

/**
 * @extends \Illuminate\Database\Eloquent\Factories\Factory<\App\Models\Book>
 */
class BookFactory extends Factory
{
    /**
     * Define the model's default state.
     *
     * @return array<string, mixed>
     */

    public function definition(): array
    {
        $answers = [
            "勇於踏出舒適圈",
            "堅守自己的信念",
            "不要為小問題困擾住",
            "每一小步都是向前邁進",
            "明天會更好",
            "你有無限的潛力",
            "時常抱有感恩的心",
            "聆聽自己內心的聲音",
            "每個人都是獨一無二的",
            "成功來自於不斷的嘗試",
            "善待自己也善待他人",
            "用心去感受生活的美好",
            "用笑容迎接每一天的挑戰",
            "相信自己的直覺",
            "今天的你沒有極限",
            "了解自己，愛自己，永遠做自己人生的主角",
            "每天出門前照照鏡子，告訴自己我可以",
            "人生多一份挫折，就會多一份感悟，多一點生活體驗",
            "長大，一個把哭聲調成聲音的過程",
            "將弱點煉成利刃，破萬難",
            "人生不是一條直線的道路，繞路走，有時候比較快",
            "經驗的價值，不在於時間的堆疊，而是質量的累積",
            "好走的路都是下坡路，難走的路會刺激你往上進步",
            "你不需要很厲害才能開始，但你需要開始才能很厲害",
            "自己選擇的路，走不完換一條就好",
            "不要怕失敗，即使摔了一跤，也回抓回一把沙",
            "你要好好愛自己",
            "不要害怕失敗",
            "相信自己，你將創造奇蹟",
            "勇敢地去探索",
            "專注於當下，不要為未來擔憂",
            "用心思考，然後採取行動",
            "每天讚美自己",
            "不要糾結於小事",
            "邁出第一步",
            "生活是一場冒險，追隨你的心",
            "付出努力，收穫幸福",
            "享受當下，感受生命的美好",
            "經歷讓你變得更強大",
            "善良是最美的力量",
            "小小的改變也很重要",
            "每一個努力都會成為未來的一部分",
            "生活充滿了驚喜和美好的事物",
            "勇敢面對生活的挑戰和變化",
            "熱情和毅力會開啟新的道路",
            "制定計劃，並努力執行",
            "擁有夢想是生活的動力",
            "相信自己可以做到",
            "勇氣來自於克服恐懼",
            "面對困難，不要放棄希望",
            "快樂是最美麗的風景",
            "用感恩之心面對生活",
            "生活中的每一天都充滿了奇跡",
            "信心是通向成功的橋樑",
        ];
        static $index = 0;

        $answer = $answers[$index];
        $index = ($index + 1) % count($answers);

        return [
            "answer" => $answer,
        ];
    }
}
